app/views/books/show.html.erb

<!-- Navigation buttons -->
<% if !@book.steps.empty? %>
---
SELECT "book_steps".* FROM "book_steps" WHERE "book_steps"."book_id" = 2
SELECT "steps".* FROM "steps" WHERE "steps"."book_id" = 2


<% if !@book.steps.empty? || !@book.runs.empty? %>
---
SELECT "runs".* FROM "runs" WHERE "runs"."book_id" = 2