app/views/steps/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."id" = 2 LIMIT 1
SELECT "steps".* FROM "steps" WHERE (id < '7' and book_id = '3') ORDER BY id desc LIMIT 1
---
  <h2><%= @step.book.title %></h2>
  <h2><b>Step 2 of <%= @step.book.steps.size %> - <%= @step.title %></b></h2>