app/views/runs/new.html.erb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "3"]]
---
<% if !@run.book.runs.nil? %>
	<p><b>ALERT: This RunBook is currently being ran <%= @run.book.runs.size %> times</b><br>