app/views/runs/show.html.erb


<%= link_to 'Book', step_path(@run.book.steps.first) %>
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "steps".* FROM "steps" WHERE "steps"."book_id" = 1 LIMIT 1