app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 05 Mar 2013 18:02:35 UTC +00:00], ["description", "asfasfasf"], ["title", "dasfsf"], ["updated_at", Tue, 05 Mar 2013 18:02:35 UTC +00:00]]
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save