app/controllers/run_steps_controller.rb

SELECT "book_steps".* FROM "book_steps" WHERE "book_steps"."id" = 4 LIMIT 1
SELECT "run_steps".* FROM "run_steps" WHERE "run_steps"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @run_step = RunStep.find(params[:id])