app/controllers/runs_controller.rb

  def index
    @runs = Run.all
---
SELECT "runs".* FROM "runs"

  def show
    @run = Run.find(params[:id])
---
SELECT "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", "2"]]

  def new

    book = Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @run = Run.new(params[:run])
    @run.user_id = session[:current_user]

    respond_to do |format|
      if @run.save
        format.html { redirect_to @run.book.steps.first, notice: 'Run was successfully created.' }
---
INSERT INTO "runs" ("book_id", "complete", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["book_id", 2], ["complete", false], ["created_at", Mon, 04 Mar 2013 16:30:57 UTC +00:00], ["updated_at", Mon, 04 Mar 2013 16:30:57 UTC +00:00], ["user_id", nil]]
SELECT "book_steps".* FROM "book_steps" WHERE "book_steps"."book_id" = 2
SELECT "books".* FROM "books" WHERE "books"."id" = 2 LIMIT 1
SELECT "run_steps".* FROM "run_steps" WHERE "run_steps"."run_id" = 1 LIMIT 1
SELECT "steps".* FROM "steps" WHERE "steps"."book_id" = 3 LIMIT 1

  def finish
      @run = Run.find(params[:id])
      @run.complete = true
      @run.save
---
SELECT "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "runs" SET "complete" = 't', "updated_at" = '2013-03-06 12:24:28.086375' WHERE "runs"."id" = 7

  def sendmail
      puts 'Sending Mail!'
      @run = Run.find(params[:id])
---
SELECT "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", "7"]]