app/controllers/runs_controller.rb

  def create
    @run = Run.new(params[:run])

    respond_to do |format|
      if @run.save
        build_run_steps(@run)
        @run.reload
        format.html { redirect_to run_run_step_path(@run,@run.run_steps.first), notice: 'Run was successfully created.' }
---
SELECT "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", 1]]