app/controllers/steps_controller.rb

  def show
    @step = Step.find(params[:id])
    @runs = @step.book.runs.all
---
SELECT "steps".* FROM "steps" WHERE (id < '7' and book_id = '3') ORDER BY id desc LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."id" = 2 LIMIT 1
SELECT "runs".* FROM "runs" WHERE "runs"."book_id" = 4 LIMIT 1

  def new
    book = Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "4"]]

  def edit
    @step = Step.find(params[:id])
---
SELECT "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT 1  [["id", "10"]]

  def create
    @step = Step.new(params[:step])

    respond_to do |format|
      if @step.save
---
INSERT INTO "steps" ("book_id", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 4], ["created_at", Wed, 06 Mar 2013 11:36:19 UTC +00:00], ["description", "asdad"], ["title", "new step"], ["updated_at", Wed, 06 Mar 2013 11:36:19 UTC +00:00]]