app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Tue, 05 Mar 2013 17:07:21 UTC +00:00], ["updated_at", Tue, 05 Mar 2013 17:07:21 UTC +00:00], ["username", "SD"]]